-------------------------------------------------------------------------------
-- chapter3/create_credential.sql
-- lakehouse 디비에서 object storage를 인식하기 위한 인증 생성
-- 유저 명 & 패스워드 정보는 실습환경에 맞춰 변경 후 진행
-------------------------------------------------------------------------------

BEGIN  
 DBMS_CLOUD.CREATE_CREDENTIAL(
   CREDENTIAL_NAME  => 'ocidemoextcred',
   ----------------------------------------------------------------------------
   -- 유저 & 패스워드 정보 변경
   ----------------------------------------------------------------------------
   USERNAME         => '<OCI유저>',
   PASSWORD         => 'xxxxxxxxxxx'
 );
END;
