#------------------------------------------------------------------------------
# chapter3/order_load.sh
# OCI func order를 100회 호출하는 스크립트
# API URL 정보를 실습환경에 맞춘 후 진행
#------------------------------------------------------------------------------

#!/bin/bash

i=1
while [ $i -lt 500 ]
do
   #------------------------------------------------------------------------------
	 # API URL 정보 (테스트 환경에 맞춰 변경할 것)
	 #------------------------------------------------------------------------------
   curl -X GET https://xxxxxxxxxxxx.apigateway.<region>.oci.customer-oci.com/v1/order
   i=$(($i+1))
done
